OdDAI.SafePathHolder.reserve(System.UInt64!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Reserve a buffer in memory with a requested size of bytes.
\param count [in] A size of buffer in bytes.

OdDAI.SafePathHolder.clearAll
\details
Removes all data and clears all buffers.

OdDAI.SafePathHolder.putPath(std.basic_string&lt;System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte,std.char_traits{System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte},std.allocator&lt;System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a path to the path holder object.
\param typeNameVector [in] An original type path (that looks like: "type1/type2/type3").

OdDAI.SafePathHolder.op_Assign(OdDAI.SafePathHolder!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copy one path holder object to another (assignment operator).
\param rightValue [in] Another path holder object to copy from (the right-hand operand of the assignment operation).
\returns The reference to the path holder object modified by the assignment operation.

OdDAI.SafePathHolder.op_Equality(OdDAI.SafePathHolder!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Compares two path holder objects (comparison operator).
\param rightValue [in] A path holder object to compare (the right-hand operand of the comparison operation).
\returns true if path holder objects are equal; otherwise, the operator returns false.

OdDAI.SafePathHolder.Dispose
\details
Destroys the path holder object.

OdDAI.SafePathHolder.#ctor(OdDAI.SafePathHolder!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new empty path holder as a copy of another path holder object (copy constructor)
\param rightValue [in] A path holder object to copy from.

OdDAI.SafePathHolder.#ctor
\details
Creates a new empty path holder.

OdDAI.SafePathHolder
\details
A class that stores and handles the path of the Select data.